app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Class"], ["room_number", 2], ["created_at", "2021-02-18 19:25:57.755059"], ["updated_at", "2021-02-18 19:25:57.755059"]]
---
    def create
        @class = SchoolClass.create(strong_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_class
        SchoolClass.find(params[:id])