app/controllers/students_controller.rb

    def create
        @student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Allie"], ["last_name", "Caton"], ["created_at", "2021-02-18 19:01:11.432412"], ["updated_at", "2021-02-18 19:01:11.432412"]]

    def update
        @student = find_student
        @student.update(strong_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Canton"], ["updated_at", "2021-02-18 19:19:17.328643"], ["id", 4]]

    def find_student
        Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]